{
    "topics": [
        {
            "topic": "B.Tech. in Automobile Engineering",
            "subtopics": []
        },
        {
            "topic": "Research Areas",
            "subtopics": [],
            "content": [
                "The Faculty of the Department of Automobile Engineering are experts in numerous disciplines and are involved in following research areas:",
                "Thermal Engineering",
                "Advanced Manufacturing",
                "Stress Analysis",
                "Biomaterial",
                "Welding Technology",
                ""
            ]
        },
        {
            "topic": "Undergraduate Labs",
            "subtopics": [],
            "content": [
                "Engineering Mechanics",
                "Automobile Engineering",
                "Production Process",
                "CAD/FEA",
                "Material Technology",
                "Mechanical Engg. Measurements",
                "Hydraulic Machinery",
                "Thermal Engineering",
                "Autotronics",
                "Vehicle Maintanance",
                ""
            ]
        },
        {
            "topic": "Program Overview",
            "subtopics": [],
            "content": [
                "Automobile Engineering, also known as Automotive Engineering, is the study of designing, operating and manufacturing automobiles and their respective subsystems such as buses, cars and trucks.",
                "An Automobile Engineer specializes in designing, testing and developing vehicles and their components from the first concept stages to final production. As the vehicle or product will continue to require constant improvement even after being launched on the market, responding to customer feedback and improving the vehicle is a vital task and duty of an Automobile Engineer.",
                "",
                "",
                "Those who have elected to study Automobile Engineering may progress into a variety of fields and disciplines such as aerodynamics, alternative fuels, chassis, electronics, emissions, ergonomics, manufacturing, materials, motorsport, powertrain, rapid prototyping, vehicle and pedestrian safety or supply chain management. It is the responsibility of an Automobile Engineer to create and maintain high standards of automobiles through the use of traditional methods and state-of-the-art technology."
            ]
        },
        {
            "topic": "Vision",
            "subtopics": [],
            "content": [
                "To develop an established institution of Automobile Engineering which will become a centre of quality standardization, research and academics through innovation, high quality teaching, projects and world class technology.",
                ""
            ]
        },
        {
            "topic": "Mission",
            "subtopics": [],
            "content": [
                "To provide quality education and knowledge that is well-grounded in the fundamental principles of engineering, which fosters innovation, and prepares students for leadership positions and successful careers in industry, academia or entrepreneurial ventures."
            ]
        },
        {
            "topic": "Program Outcomes (POs)",
            "subtopics": [],
            "content": [
                "Engineering Graduates will be able to:",
                "Engineering Knowledge:Apply the knowledge of mathematics, science, engineering fundamentals and an engineering specialization to the solution of complex engineering problems.",
                "Problem Analysis:Identify, formulate, review research literature and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences and engineering sciences.",
                "Design / Development of Solutions:Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal and environmental considerations.",
                "Conduct Investigations of Complex Problems:Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data and synthesis of the information to provide valid conclusions.",
                "Modern Tool Usage:Create, select and apply appropriate techniques, resources and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.",
                "The Engineer and Society:Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
                "Environment and Sustainability:Understand the impact of the professional engineering solutions in societal and environmental contexts and demonstrate the knowledge of and need for sustainable development.",
                "Ethics:Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
                "Individual and Team Work:Function effectively as an individual and as a member or leader in diverse teams and in multidisciplinary settings.",
                "Communication:Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations and give and receive clear instructions.",
                "Project Management and Finance:Demonstrate knowledge and understanding of the engineering and management principles and apply these to one 2019s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.",
                "Life-long Learning:Recognize the need for and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change.",
                ""
            ]
        },
        {
            "topic": "Program Educational Objectives (PEOs)",
            "subtopics": [],
            "content": [
                "Students should develop sound fundamental knowledge in mathematics, science and automobile engineering.",
                "Students would acquire an ability to function productively as an individual as well as in a team and are well versed in using modern technology and equipment to solve real world problems.",
                "Students would be provided with opportunities to develop an instinct for innovation and skills as researchers through industry collaboration, practical training, laboratory experience, projects and the various courses offered to them.",
                "Students would inculcate a professional and ethical attitude, good leadership qualities and commitment to social responsibilities in their thought process.",
                "Students will be encouraged to understand the importance of lifelong learning, working on contemporary global issues and to become a successful entrepreneur.",
                ""
            ]
        }
        
        
        
    ]
}