{
    "post_title": "Social Service",
    "content": [
        {
            "text": "Social Responsibility Committee was established with a view of inculcating moral values in the minds of the students and making them socially aware about the difficulties and hardships of society. These socially aware minds tend to empathize towards others regardless of race, gender, ethnicity, disability, class or sexual identity and hence help contribute towards building a healthy society.Maharashtra Flood ReliefStand with Western Maharashtra-Flood ReliefMES and the Pillai Group of Institutions stand with the people of Western Maharashtra in their time of need due to the catastrophic flood situation. All staff and students were requested to contribute to the Flood Relief Operations in any form possible. Few items were listed that would be of immense help to the people of Maharashtra.The collection drive took place from 13th to 17th August at the Main Reception Area of the Pillai Panvel Campus. All were encouraged to contribute to this cause and do their part in helping the people of Maharashtra.Tree Plantation Drive and River Clean DriveA tree plantation drive followed by a river cleaning drive was organized on 11th January, 2020 in collaboration with the volunteers of Alegria council and NSS-PCE.Around 150 students took part in the event held at CIDCO garden, sector 16, New Panvel and Podi Visarjan Ghat, Sector 15, New Panvel.The main aim of drive was to raise awareness on the need to protect the environment from further pollution. The committee member briefed the students about the drive and divided them in groups to plant 50 saplings. All volunteers digged into the soil using shovels one by one under the guidance of garden care taking authorities with proper safety measures. The chief guests for the event were Tejas Kandpile, Panvel Muncipal Corporation (PMC) corporator; former corporator Subhash Bhujbal; Gourav Hingane, assistant engineer with CIDCO Panvel; Shailesh Gaikwad, health inspector at PMC; Arun Kamble, sanitary inspector PMC; and Rakesh Bhujbal at PMC. College faculty Bhagwan More felicitated the guests.After the plantation drive, students took part in the river cleaning drive. The students and PMC Cleaning Team joined hands to clean the river. All volunteers cleaned the river coast gathering waste material like plastic, glass, papers, sacks etc. Proper safety measures were taken with usage of gloves and mask for protection. At the end few officers were invited to check the work done and they applauded for the co operative efforts applied by the entire team. The collected trash was sorted in two different bins; one for biodegradable and one for non-biodegradable waste.Refreshments were provided to all and it was emphasized that all participating volunteers were safe during the entire event.The program concluded with all the participants taking an oath to protect the environment.Houses for Kerala Flood Victims"
        }
    ]
}