{
    "post_title": "Institutional Distinctiveness",
    "content": [
        {
            "subheading": null,
            "list": [
                "2022-23",
                "2021-22",
                "About"
            ]
        },
        {
            "subheading": null,
            "paragraph": "view Institutional Distinctiveness 2022-23 (.pdf)"
        },
        {
            "subheading": null,
            "paragraph": "view Institutional Distinctiveness 2021-22 (.pdf)"
        },
        {
            "subheading": "Institutional Distinctiveness",
            "paragraph": "In line to the institute’s vision of making responsible technical professionals with the help of trained and dedicated teachers, PCE has taken numerous initiatives to develop both students and faculty. The institute takes a 360 view of the development of itself and all its stakeholders. PCE has articulated broad institutional goals such as"
        },
        {
            "subheading": "Institutional Distinctiveness",
            "list": [
                "Empowerment of its stakeholders (Faculty, students, employers, alumni)",
                "Increased Industry interactions through training, placement and consultancy",
                "Conducting impactful research through its research centers and encouraging technology transfer",
                "Creating social, moral, environmental awareness by following best practices such as recycling, using renewable sources or energy, value education, community service etc.",
                "PCE also believes in maximum automation of its various processes so that faculty and students can focus on teaching, learning and research."
            ]
        },
        {
            "subheading": "Institutional Distinctiveness",
            "paragraph": "It believes that this will not only develop professional engineers having respect for the environment and nation but also will contribute to technological development both from an Indian and global perspective. The 360 perspective of the institute and its development is a distinctive aspect of the PCE Mission and Vision and is shown in the charts attached."
        },
        {
            "subheading": "Institutional Distinctiveness",
            "paragraph": "Student Centered Activity:Various activities are undertaken at PCE to inculcate the following qualities in the students"
        },
        {
            "subheading": "Institutional Distinctiveness",
            "list": [
                "Enhance Teaching LearningPCE practices project based learning and also extensive academic learning through study camp and prelims. In order to enhance the learning skills, students are mentored and motivated to enroll in various NPTEL and MOOC courses. Remedial classes are also undertaken for slow learners.",
                "LeadershipStudents council and students in the Institute committee greatly boost up the leadership qualities in the students. Participation in Alegria and sports events adds up to the personality development of the students.",
                "Research and Industry ReadinessStudents are made industry ready by offering collaborative projects with industry and through industrial visits. The research centre developed at PCE also gives them opportunity to work on technological and social issues. This has greatly helped them to perform better at national level project competitions and hackathons. Interactive sessions by the Alumni are organised for knowledge sharing.",
                "EmployabilityThe present competition in the field of industry and research demands an engineer who not only has academic knowledge but is also enriched with soft skills, practical exposure, aptitude capability etc. Student skill development programs are organised at PCE along with imparting internships programs and mentoring to make them employable.",
                "Social, Moral and Ethical ValuesBeside academics, it is important for students to be responsible citizens with good moral and ethical values and also contribute towards society. To achieve this PCE provides value education to students and inculcates in them academic honesty and avoid plagiarism. Students engage in social causes through events such as Community service day and cleanliness drive for environmental awareness.",
                "EntrepreneurshipPillai Centre of Innovation and Entrepreneurship (PCIE) since its inception in 2015 is an end-to-end support system for budding entrepreneurs in realizing their business ideas culminate into commercial entities. PCIE conducts relevant workshops and seminars frequently which has not only enabled students to hone their business and networking skills but also inspired them to embark on entrepreneurial explorations."
            ]
        },
        {
            "subheading": "Institutional Distinctiveness",
            "paragraph": "Faculty Centered Activity:As PCE believes that development of the faculty is equally important as that of the students, various enrichment activities are materialized in different fields of development."
        },
        {
            "subheading": "Institutional Distinctiveness",
            "list": [
                "Enhanced Teaching LearningPCE believes in creating an enhanced and supportive teaching and learning experience for students and faculty. Faculty members are given continuous opportunities to improve their teaching through regular FDPs, MOOCs and NPTEL. They also have access to online platforms for ease of administration such as Mentor-Mentee portal, Self appraisal portal, Academic management system. Faculty are also encouraged to create their own E-content through the e-learning studio available in the college.",
                "Research and ConsultancyPCE has established various centers of excellence in various fields to encourage faculty expertise in certain areas or research. These centers bring together faculty having different backgrounds and they have a common research goal. It also creates a hub where faculty can carry out related consultancy activities Funds are also provided to conduct regular seminars, conferences and workshops on specialised topics of interest. In addition, faculty are interested in pursuing MOUs with industries for activities such as joint research, common use of facilities, library access, placement and internships etc.",
                "LeadershipPCE believes in developing the leadership abilities in its faculty. This is done through active participation of the faculty in the administration of the institute and memberships in various committees of the University of Mumbai such as the Board of Studies. It also encourages faculty to become members of various professional associations and assume leadership roles in them.",
                "Social, Moral and Ethical ValuesFaculty are the lighting source for the students and every faculty at PCE is actively involved to take up social responsibility and encourage students by participating in Social events like Community Service day, Uber Rang. The Faculty also engaged in research work following code of ethics in presenting their own idea and refraining from plagiarized work. Staff has been instrumental in conservation and recycling schemes by following and practising e-waste management.",
                "Professional DevelopmentPCE offers numerous professional development schemes such as research promotion schemes, IPR support, grants for travel, conferences and support for higher education, support for faculty training. PCE functions as a remote center for IIT Bombay and faculty can get various certifications sponsored through that program."
            ]
        },
        {
            "subheading": "Institutional Distinctiveness",
            "paragraph": "All the initiatives practiced at PCE assures a 360 degree development of both students and faculty which contributes to progress of institute and nation."
        },
        {
            "links": [
                {
                    "text": "2022-23",
                    "href": "#1670845539794-0e1a92fc-d7ef"
                },
                {
                    "text": "2021-22",
                    "href": "#1708515904816-a321aa24-41d5"
                },
                {
                    "text": "About",
                    "href": "#1670845539798-019b9221-f6fa"
                },
                {
                    "text": "2022-23",
                    "href": "#1670845539794-0e1a92fc-d7ef"
                },
                {
                    "text": "view Institutional Distinctiveness 2022-23 (.pdf)",
                    "href": "https://www.pce.ac.in/wp-content/uploads/2024/02/PCE-Distinctiveness-AY-2022-23.pdf"
                },
                {
                    "text": "2021-22",
                    "href": "#1708515904816-a321aa24-41d5"
                },
                {
                    "text": "view Institutional Distinctiveness 2021-22 (.pdf)",
                    "href": "https://www.pce.ac.in/wp-content/uploads/2022/12/Distinctiveness-2021-22.pdf"
                },
                {
                    "text": "About",
                    "href": "#1670845539798-019b9221-f6fa"
                }
            ]
        }
    ]
}