{
    "post_title": "Institutional Values and Best Practices",
    "content": [
        {
            "subheading": null,
            "list": [
                "2022-23",
                "2021-22",
                "About"
            ]
        },
        {
            "subheading": null,
            "paragraph": "view Best Practices 2022-23 (.pdf)"
        },
        {
            "subheading": null,
            "paragraph": "view Best Practices 2021-22 (.pdf)"
        },
        {
            "subheading": null,
            "paragraph": ""
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": "Objective of the Practice:"
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": "The institute requires that its faculty do innovative and impactful research in various fields. In order to do this it is required that the institute identifies areas of research where faculty can complement each other’s specialization. It is also required that facilities such as equipment and software be made available, industry partners identified, and strategies be developed to commercialize the research work being done. PCE has taken an initiative to strengthen its research and industry connections by setting up centers of excellence in various fields."
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": "The basic objectives of the centers are:"
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "list": [
                "Improve faculty research output by providing facilities, infrastructure, software etc in certain focus areas.",
                "Motivate students to become entrepreneurs to contribute for nation development.",
                "Skill development of faculty through consultancy projects and MOUs with industries."
            ]
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": ""
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": "The Context:Even though the institute received its first major research grant in 2007, there was a lack of research initiative among the faculty. Most of the research is done in an uncoordinated and disconnected manner. It was noted that faculty should be encouraged to publish papers in quality journals. Upto 2014 the institute lacked any focus areas where facilities can be created and faculty expertise can be developed. Prior to 2012, there were very few MOUs, consultancy projects and research initiatives in the institute. Also the research that was being done did not have much relevance to society and not many companies were being inspired by the work being done by the institute. Since the resources of the institute are limited it was decided that the institute would pick only certain focus areas of research in which it would excel."
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": "The Practice:The various practices which are followed at the institute are:"
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": "1. Center of Excellence:PCE has a centre of excellence in order to facilitate and provide new opportunities to the faculty and students. It also helps in providing solutions to specific social and technological issues.The initiatives taken are as follows:"
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "list": [
                "Urban Expansion ObservatoryNYU Stern is a long term partner of the institute and has established the Urban Expansion Observatory at PCE. The UXO aims at measuring the quality of global urban expansion from 1990 to 2013 through satellite imageries for fringe areas of 200 cities worldwide. In addition to the data analysis, UXO also conducts numerous development and training activities in GIS and remote sensing, urban Planning and Development.",
                "Makers’ StudioProvides all fabrication facilities under one roof for the students. This workplace comprises all the necessary equipment for cutting, 3D printing, grinding, drilling, milling, soldering, laser cutting etc. The students are given hands-on training on these equipment during the Makers’ Day event organized by the institute every year.",
                "Drone LabPCE has a center where drones can be fabricated and developed. It also has professional drones available and are used for consultancy projects. These drones are used to do 2D and 3D mapping of land and civil structures.",
                "Future CitiesCenter of Excellence for Future Cities is established to utilise the expertise available at PCE to cater to issues and challenges related to city and urban development."
            ]
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": ""
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": "2. Industry-Institute Interactions:Joint ventures with various organisations and industries have opened new areas of research and opportunitiesSome of them are:"
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "list": [
                "MOU with Indian Institute of Packaging which is controlled by the Ministry of Commerce and Industry, Government of India.",
                "MOUs for consulting services for IPR and Patent filing between MES and Brainiac IP Solutions.",
                "MOUs with IFS Academy, Pune for conducting various value added courses in the institute at subsidised rate.",
                "Provide various platforms like Coursera, IIT Bombay Spoken Tutorials to upgrade the technical and soft skills of the students and make them Industry ready.",
                "Organising talk series by industries professionals for the students to make them aware of the industry requirement and develop themselves to bridge the gap between Industries and academics."
            ]
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": ""
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": "3. Entrepreneurship Cell:Pillai Centre of Innovation and Entrepreneurship (PCIE) since its inception in 2015 is an end-to-end support system for budding entrepreneurs in realizing their business ideas culminate into commercial entities. The institute has developed the Institute Innovation Council to enhance the Entrepreneurial activities in the campus. PCIE conducts relevant workshops and seminars frequently which has enabled aspiring students to hone their business and networking skills and embark on entrepreneurial explorations. It also organizes Business Plan Competition to motivate budding entrepreneurs."
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": "Evidence of Success:The exposure of the faculty to the centers of excellence has enhanced their experiential learning and led to improvement in research grants, consultancy projects, internships and startups."
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "list": [
                "Joint research with UXO has been published in the Economic Survey of India Vol 2 and is one of the documents which form the basis of policy making for the Government of India.",
                "Through the annual Business Plan Competition, PCIE has ably supported 10 start-ups in finance, business, marketing space etc.",
                "The Maker’s Studio generated for the students and research scholars is the most widely used facility every semester and is being used for completion of almost 30% BE projects, 90% PBL projects and 50% PG projects.",
                "The Drone lab has been used by faculty to provide consultancy to government and non government agencies like CIDCO, TCE, HCC etc. The amount of consultancy received is about 10 lakhs till date.",
                "This has also led to a substantial increase in grants and consultancy received from agencies such as AICTE, DST, BRNS. Between 2004-2009, PCE received 26.27 lakhs among 3 faculty, between 2009-2014, PCE received 103.56 lakhs among 17 faculty and between 2014-2019, PCE received 197.11 lakhs among 40 faculty, all from external agencies.",
                "Institution’s Innovation Council – Pillai College of Engineering (IIC PCE) has been awarded 5 Star Rating by the Ministry of Education’s Innovation Cell, MIC and AICTE."
            ]
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": ""
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": "Problems Encountered and Resources Required:"
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "list": [
                "The execution and development of the initiatives has to be done in tandem with the regular academic responsibilities of the staff.",
                "Since the number of faculty and students benefiting from the various schemes are increasing more funds are required to sustain research programs."
            ]
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": ""
        },
        {
            "subheading": "Creating Impact Through Centers of Excellence in Research, Consultancy and Entrepreneurship",
            "paragraph": ""
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "Objective of the Practice:PCE strives hard to bring out the best in students, both by academic success as well as career readiness. This is accomplished through,"
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "list": [
                "Extensive academic learning via open book prelims and study camps is practiced to make students more confident in approaching the university exams.",
                "Project based learning which helps students to enhance their knowledge by applying theoretical knowledge that they learn during lecture hours to real world problems. This also helps the students to understand basic concepts and their application to live problems.",
                "Sponsor internal and external competitions where students can hone their skills."
            ]
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": ""
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "The Context:In general the students who are admitted to PCE are not completely prepared for the engineering field and it is a challenge to make them think like an “engineer”. In order to boost their confidence and improve performance in University exams study camps and open book prelims have proven to be effective. In addition to examination preparation it is also essential that students have practical experience in solving real world Engineering problems. This is where the institute has implemented project based learning. Here students are given an open ended project and they are encouraged to find different solutions to the same problem. They are also provided with various resources to complete the project."
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "The Practice:Study CampandOpen Book Prelimsare organized for extensive learning of the students. Two sets of question papers prepared as per the university pattern based on the entire syllabus for prelims. In study camp teachers help students and guide them in writing answers for the questions. During study camp, the subject teacher is available in the class to interact with students for doubt solving."
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "Component Library:consist of all the electronic components to possible mechanical instruments, which any admitted student can issue for a specific time period. This helps students to develop projects without worrying about money to buy or find components in the market. The library has every possible component from resistors sensors to actuators to microcontroller / processor."
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "Makers Day:The maker culture is a contemporary culture or subculture representing a technology-based extension of DIY culture that revels in the creation of new devices as well as tinkering with existing ones. With the above spirit, PCE organises a MAKERS’ DAY every year. During this time, all the facilities available for creative pursuit would be provided free access to all the students for a hands-on feel. The exposure is expected to inspire students to make things, may be for PBL, BE project, mini-project or just satisfying his creative impulse."
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "PBL Project Competition:First, Second and Third year students are all assigned a project every semester that incorporates concepts that students have learned during the semester as well as previous semesters. The students are generally given specific technical problems or challenges to solve in the beginning of the term and they are supposed to implement it by the end. The best projects are given certificates from the department."
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "BE Project Competition:BE project competition is organised and top 3 teams from each department are felicitated. The criteria for evaluation is"
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "1. Originality2. Technical Complexity3. Commercial viability or Benefit to Society4. Quality of Literature Review5. Aesthetics"
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "Student Activities Fund:The institute has allotted Rs 10 lakh per academic year for students projects and activities. Student groups or individual students working under faculty can apply for funds through this scheme. The scheme is meant to support student groups or individual students participating in competitions such as Smart India hackathon, Formula SAE etc. The limit for a single student is Rs 10,000 and for a group of students is Rs. 1,50,000."
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "Value Added Courses:The faculty members at PCE are organizing various value added courses so that students can expertise themselves in their area of interest and learn things beyond academics."
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "Evidence of Success:Indicative success stories in terms of academic results and participation in competitions"
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "Reforms in the teaching learning process at PCE are evident from consistent improvement in University results of the First year from about 30% a few years back to more than 60% since the last couple of years. Securing University top ranks in final year is an outcome of consistent efforts."
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "PCE has consistently represented University of Mumbai at state level Research Convention AVISHKAR since 2014-15 and produced UG and PG Gold and Silver Medalists in 2015 and 2018. The winning project titled Stealth Application is currently used by Navi Mumbai Crime branch to track criminal activities."
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "Right from the first edition of AICTE Smart India Hackathon our student teams have participated in Software as well as Hardware category. In the first edition of SIH 2016, 3 teams got selected for the final round of software edition and one team secured 8th position at all India level. In 2018, Team Prayas participated in the hardware edition and won second prize. Team Prayas also won 1st Runner up in AICTE-ISTE-ECI Chatra Vishwakarma Award at the all India Level. In SIH-2019, 6 teams were selected for the final round and two teams secured first position at two different centers in the software category."
        },
        {
            "subheading": "Enhanced Teaching and Learning",
            "paragraph": "Problems Encountered and Resources Required:Resources including teaching and non teaching staff is required to participate in the smooth conduct of the Study Camp and prelims. Classrooms have to be reserved for these activities which prevent lectures to be conducted during study camp and Open book Prelim. Therefore, teachers have to plan their classes well such that their syllabus coverage is not affected. A large amount of stationary and manpower is required for accomplishing the task. Some of the students who are not willing to participate have to be counselled and motivated by making them aware of the future advantage of the practice."
        },
        {
            "links": [
                {
                    "text": "2022-23",
                    "href": "#1670844413497-c4736852-0ab0"
                },
                {
                    "text": "2021-22",
                    "href": "#1708515578662-47d2efac-faaf"
                },
                {
                    "text": "About",
                    "href": "#1670844413517-051b6507-8b9f"
                },
                {
                    "text": "2022-23",
                    "href": "#1670844413497-c4736852-0ab0"
                },
                {
                    "text": "view Best Practices 2022-23 (.pdf)",
                    "href": "https://www.pce.ac.in/wp-content/uploads/2024/02/PCE-Best-Practices-AY-2022-23.pdf"
                },
                {
                    "text": "2021-22",
                    "href": "#1708515578662-47d2efac-faaf"
                },
                {
                    "text": "view Best Practices 2021-22 (.pdf)",
                    "href": "https://www.pce.ac.in/wp-content/uploads/2022/12/Best-Practices-2021-22.pdf"
                },
                {
                    "text": "About",
                    "href": "#1670844413517-051b6507-8b9f"
                }
            ]
        }
    ]
}