[
    {
        "Type": "paragraph",
        "Content": "Home » Academics » Other Programs » MOOCs and NPTEL"
    },
    {
        "Type": "heading",
        "Content": "MOOCs and NPTEL"
    },
    {
        "Type": "heading",
        "Content": "MOOCs"
    },
    {
        "Type": "paragraph",
        "Content": "Massive Open Online Courses (MOOCs) are free online courses available for anyone to enroll. MOOCs provide an affordable and flexible way to learn new skills, advance your career and deliver quality educational experiences at scale."
    },
    {
        "Type": "paragraph",
        "Content": "MOOC.org is an extension of edX.org, a leader in online courses. Whether you’re interested in learning for yourself, leveraging online courses to educate your workforce or creating a MOOC, edX can help. Explore online courses and programs in key fields like Apache Spark, Artificial Intelligence, Azure, Big Data, Blockchain, Business and Management, Computer Science, Cybersecurity, C, C++, C#, Data Science, Entrepreneurship, Excel, Java, JavaScript, Linux, Machine Learning, Python, R Programming, Robotics, Statistics, Spanish, SQL, Web Development and more."
    },
    {
        "Type": "heading",
        "Content": "IITBombayx"
    },
    {
        "Type": "paragraph",
        "Content": "(Open-source Hybrid MOOCs Platform from India)"
    },
    {
        "Type": "paragraph",
        "Content": "IITBombayX is an online platform developed by IIT Bombay, to offer Massive Open Online Courses (MOOCs) for individuals from varying backgrounds. We specialize in Hybrid MOOCs which captures the benefits of flipped classrooms, online lectures, and live interactions with the IITBombayX course instructors."
    },
    {
        "Type": "paragraph",
        "Content": "IITBombayX offers four different types of MOOCs for various learning needs. Our college being the Remote Centre of IIT Bombay facilitate these courses in our campus."
    },
    {
        "Type": "paragraph",
        "Content": "How it works\nIITBombayX is an open online learning platform aimed at alleviating some of the issues of access and quality issues in higher education in the country. IITBombayX offers four types of MOOCs to meet personalized requirements of scholars in different phases of their lives. We present courses for academics/education (EduMOOCs), for working professionals and others desiring to pursue life-long learning (LifeMOOCs), for skilling and vocational training (SkillMOOCs) and for teacher training (TeachMOOCs)."
    },
    {
        "Type": "paragraph",
        "Content": "In order to provide maximum flexibility to our learners, all courses are available in one or more of the selected modes of delivery such as instructor-led (Instructor-paced MOOC), instructor-paced with face-to-face interactions (Hybrid MOOC) and at learner’s own pace with flexibility to join and complete the course (Self-paced MOOC)."
    },
    {
        "Type": "paragraph",
        "Content": "Courses\nIITBombayX offers numerous interactive courses listed below, including ongoing, upcoming and archived courses. Each of these courses are categorized under EduMOOCs, LifeMOOCs, SkillMOOCs and TeachMOOCs for various learning needs.\nClick here to know about courses: https://iitbombayx.in/courses"
    },
    {
        "Type": "heading",
        "Content": "NPTEL"
    },
    {
        "Type": "paragraph",
        "Content": "The National Programme on Technology Enhanced Learning (NPTEL) was initiated by seven Indian Institutes of Technology (Bombay, Delhi, Kanpur, Kharagpur, Madras, Guwahati and Roorkee) along with the Indian Institute of Science, Bangalore in 2003. Five core disciplines were identified, namely, civil engineering, computer science and engineering, electrical engineering, electronics and communication engineering and mechanical engineering and 235 courses in web/video format were developed in this phase."
    },
    {
        "Type": "paragraph",
        "Content": "The main goal of NPTEL Phase II (2009-14) was to build on the engineering and core science courses launched previously in NPTEL Phase I. An additional 600 web and video courses were created in all major branches of engineering, physical sciences at the undergraduate and postgraduate levels and management courses at the postgraduate level. Several improvements such as indexing of all video and web courses and keyword search were implemented."
    },
    {
        "Type": "heading",
        "Content": "NPTEL MOOCs"
    },
    {
        "Type": "paragraph",
        "Content": "NPTEL began offering open online courses in March 2014 along with certificates from the IITs/IISc for those who completed the courses successfully."
    },
    {
        "Type": "paragraph",
        "Content": "It is now possible for ANYONE outside the IIT System to be able to do an online certification course from NPTEL and get a certificate from the IITs. IITs are reaching out and taking education to the homes of people through this initiative."
    },
    {
        "Type": "paragraph",
        "Content": "For more details about the courses:\nClick here https://nptel.ac.in/course.php"
    }
]